maxabba/Ota-mqtt-http/src/ESP32OtaMqtt.cpp
#include "ESP32OtaMqtt.h"

// Static instance for callback
ESP32OtaMqtt* ESP32OtaMqtt::instance = nullptr;

// Constructor with existing WiFi only
ESP32OtaMqtt::ESP32OtaMqtt(WiFiClientSecure& wifi, const String& topic) 
    : wifiClient(&wifi), updateTopic(topic), ownsMqttClient(true),
      currentStatus(OtaStatus::IDLE), lastCheck(0), retryCount(0),
      statusCallback(nullptr), errorCallback(nullptr), useInsecure(false) {
    
    mqttClient = new PubSubClient(*wifiClient);
    instance = this;
}

// Constructor with existing WiFi and MQTT
ESP32OtaMqtt::ESP32OtaMqtt(WiFiClientSecure& wifi, PubSubClient& mqtt, const String& topic)
    : wifiClient(&wifi), mqttClient(&mqtt), updateTopic(topic), ownsMqttClient(false),
      currentStatus(OtaStatus::IDLE), lastCheck(0), retryCount(0),
      statusCallback(nullptr), errorCallback(nullptr), useInsecure(false) {
    
    instance = this;
}

// Destructor
ESP32OtaMqtt::~ESP32OtaMqtt() {
    if (ownsMqttClient && mqttClient) {
        delete mqttClient;
    }
    if (instance == this) {
        instance = nullptr;
    }
}

// Configuration methods
void ESP32OtaMqtt::setConfig(const OtaConfig& newConfig) {
    config = newConfig;
}

OtaConfig ESP32OtaMqtt::getConfig() const {
    return config;
}

void ESP32OtaMqtt::setCheckInterval(unsigned long intervalMs) {
    config.checkInterval = intervalMs;
}

void ESP32OtaMqtt::setDownloadTimeout(unsigned long timeoutMs) {
    config.downloadTimeout = timeoutMs;
}

void ESP32OtaMqtt::setMaxRetries(int retries) {
    config.maxRetries = retries;
}

void ESP32OtaMqtt::setCurrentVersion(const String& version) {
    config.currentVersion = version;
}

// MQTT configuration methods
void ESP32OtaMqtt::setMqttCredentials(const String& user, const String& password) {
    mqttUser = user;
    mqttPassword = password;
    Serial.println("[OTA] MQTT credentials configured for user: " + user);
}

// SSL/TLS configuration methods
void ESP32OtaMqtt::setCACert(const char* caCert) {
    this->caCert = String(caCert);
    useInsecure = false;
    
    // Apply CA certificate to WiFiClientSecure using stored string
    wifiClient->setCACert(this->caCert.c_str());
    Serial.println("[OTA] CA certificate configured for secure MQTT connection");
}

void ESP32OtaMqtt::setClientCert(const char* clientCert, const char* clientKey) {
    this->clientCert = String(clientCert);
    this->clientKey = String(clientKey);
    
    // Apply client certificate and key
    wifiClient->setCertificate(clientCert);
    wifiClient->setPrivateKey(clientKey);
    Serial.println("[OTA] Client certificate and key configured");
}

void ESP32OtaMqtt::setCACertFromFile(const String& caCertPath) {
    if (!SPIFFS.begin(true)) {
        reportError("Failed to mount SPIFFS");
        return;
    }
    
    File file = SPIFFS.open(caCertPath, "r");
    if (!file) {
        reportError("Failed to open CA certificate file: " + caCertPath);
        return;
    }
    
    String cert = file.readString();
    file.close();
    
    if (cert.length() == 0) {
        reportError("CA certificate file is empty: " + caCertPath);
        return;
    }
    
    // Debug: Print certificate info
    Serial.println("[OTA] Certificate file size: " + String(cert.length()) + " bytes");
    Serial.println("[OTA] Certificate starts with: " + cert.substring(0, min(50, (int)cert.length())));
    Serial.println("[OTA] Certificate ends with: " + cert.substring(max(0, (int)cert.length()-50)));
    
    // Validate certificate format
    if (!cert.startsWith("-----BEGIN CERTIFICATE-----")) {
        reportError("Invalid certificate format - missing BEGIN CERTIFICATE header");
        return;
    }
    
    if (!cert.endsWith("-----END CERTIFICATE-----") && !cert.endsWith("-----END CERTIFICATE-----\n")) {
        reportError("Invalid certificate format - missing END CERTIFICATE footer");
        return;
    }
    
    setCACert(cert.c_str());
    Serial.println("[OTA] CA certificate loaded from SPIFFS: " + caCertPath);
}

void ESP32OtaMqtt::setClientCertFromFiles(const String& clientCertPath, const String& clientKeyPath) {
    if (!SPIFFS.begin(true)) {
        reportError("Failed to mount SPIFFS");
        return;
    }
    
    // Read client certificate
    File certFile = SPIFFS.open(clientCertPath, "r");
    if (!certFile) {
        reportError("Failed to open client certificate file: " + clientCertPath);
        return;
    }
    
    String cert = certFile.readString();
    certFile.close();
    
    // Read client key
    File keyFile = SPIFFS.open(clientKeyPath, "r");
    if (!keyFile) {
        reportError("Failed to open client key file: " + clientKeyPath);
        return;
    }
    
    String key = keyFile.readString();
    keyFile.close();
    
    if (cert.length() == 0 || key.length() == 0) {
        reportError("Client certificate or key file is empty");
        return;
    }
    
    setClientCert(cert.c_str(), key.c_str());
    Serial.println("[OTA] Client certificate and key loaded from SPIFFS");
}

void ESP32OtaMqtt::setInsecure(bool insecure) {
    useInsecure = insecure;
    
    if (insecure) {
        wifiClient->setInsecure();
        Serial.println("[OTA] WARNING: Using insecure connection (certificates not verified)");
    } else {
        Serial.println("[OTA] Secure connection enabled");
    }
}

// Callback registration
void ESP32OtaMqtt::onStatusUpdate(OtaStatusCallback callback) {
    statusCallback = callback;
}

void ESP32OtaMqtt::onError(OtaErrorCallback callback) {
    errorCallback = callback;
}

// Semantic version comparison
bool ESP32OtaMqtt::isNewerVersion(const String& newVersion, const String& currentVersion) {
    return compareVersions(newVersion, currentVersion) > 0;
}

int ESP32OtaMqtt::compareVersions(const String& v1, const String& v2) {
    if (v1 == v2) return 0;
    
    // Parse version strings (e.g., "1.2.3")
    int v1Parts[3] = {0, 0, 0};
    int v2Parts[3] = {0, 0, 0};
    
    // Parse v1
    int partIndex = 0;
    String temp = "";
    for (int i = 0; i < v1.length() && partIndex < 3; i++) {
        char c = v1.charAt(i);
        if (c == '.') {
            v1Parts[partIndex++] = temp.toInt();
            temp = "";
        } else if (isDigit(c)) {
            temp += c;
        }
    }
    if (partIndex < 3 && temp.length() > 0) {
        v1Parts[partIndex] = temp.toInt();
    }
    
