maxabba/Ota-mqtt-http/src/ESP32OtaMqtt.cpp
    // Parse v2
    partIndex = 0;
    temp = "";
    for (int i = 0; i < v2.length() && partIndex < 3; i++) {
        char c = v2.charAt(i);
        if (c == '.') {
            v2Parts[partIndex++] = temp.toInt();
            temp = "";
        } else if (isDigit(c)) {
            temp += c;
        }
    }
    if (partIndex < 3 && temp.length() > 0) {
        v2Parts[partIndex] = temp.toInt();
    }
    
    // Compare parts
    for (int i = 0; i < 3; i++) {
        if (v1Parts[i] > v2Parts[i]) return 1;
        if (v1Parts[i] < v2Parts[i]) return -1;
    }
    
    return 0;
}

// Static MQTT callback wrapper
void ESP32OtaMqtt::staticMqttCallback(char* topic, byte* payload, unsigned int length) {
    if (instance) {
        instance->mqttCallback(topic, payload, length);
    }
}

// MQTT message handler
void ESP32OtaMqtt::mqttCallback(char* topic, byte* payload, unsigned int length) {
    if (String(topic) != updateTopic) return;
    
    String message;
    for (unsigned int i = 0; i < length; i++) {
        message += (char)payload[i];
    }
    
    Serial.println("[OTA] Received update message: " + message);
    
    if (parseUpdateMessage(message)) {
        // Check if this is a newer version
        if (isNewerVersion(pendingVersion, config.currentVersion)) {
            Serial.println("[OTA] New version available: " + pendingVersion);
            updateStatus(OtaStatus::DOWNLOADING);
            
            // Start download in next loop iteration to avoid blocking MQTT
            // The actual download will be handled in loop()
        } else {
            Serial.println("[OTA] Version " + pendingVersion + " is not newer than current " + config.currentVersion);
        }
    }
}

// Simple JSON value extractor
String ESP32OtaMqtt::extractJsonValue(const String& json, const String& key) {
    String searchKey = "\"" + key + "\"";
    int keyIndex = json.indexOf(searchKey);
    if (keyIndex == -1) return "";
    
    int colonIndex = json.indexOf(":", keyIndex);
    if (colonIndex == -1) return "";
    
    int startIndex = json.indexOf("\"", colonIndex);
    if (startIndex == -1) return "";
    startIndex++; // Skip opening quote
    
    int endIndex = json.indexOf("\"", startIndex);
    if (endIndex == -1) return "";
    
    return json.substring(startIndex, endIndex);
}

// Parse JSON update message
bool ESP32OtaMqtt::parseUpdateMessage(const String& message) {
    // Extract required fields using simple parser
    String version = extractJsonValue(message, "version");
    String url = extractJsonValue(message, "firmware_url");
    String checksum = extractJsonValue(message, "checksum");
    String command = extractJsonValue(message, "command");
    
    if (version.isEmpty() || url.isEmpty() || checksum.isEmpty() || command.isEmpty()) {
        reportError("Missing required fields in update message");
        return false;
    }
    
    if (command != "update") {
        Serial.println("[OTA] Ignoring non-update command: " + command);
        return false;
    }
    
    pendingVersion = version;
    pendingUrl = url;
    pendingChecksum = checksum;
    
    return true;
}

// Initialize the OTA updater
bool ESP32OtaMqtt::begin() {
    if (!WiFi.isConnected()) {
        reportError("WiFi not connected");
        return false;
    }
    
    // Set up MQTT callback
    mqttClient->setCallback(staticMqttCallback);
    
    Serial.println("[OTA] ESP32 OTA MQTT updater initialized");
    Serial.println("[OTA] Current version: " + config.currentVersion);
    Serial.println("[OTA] Update topic: " + updateTopic);
    Serial.println("[OTA] Check interval: " + String(config.checkInterval) + "ms");
    
    return true;
}

// Non-blocking main loop
void ESP32OtaMqtt::loop() {
    if (!WiFi.isConnected()) return;
    
    // Handle MQTT connection
    if (!mqttClient->connected()) {
        // Try to reconnect (non-blocking)
        static unsigned long lastReconnectAttempt = 0;
        if (millis() - lastReconnectAttempt > 5000) {
            lastReconnectAttempt = millis();
            Serial.println("[OTA] Attempting MQTT connection...");
            String clientId = "OTA_" + WiFi.macAddress();
            bool connected = false;
            
            if (mqttUser.length() > 0 && mqttPassword.length() > 0) {
                connected = mqttClient->connect(clientId.c_str(), mqttUser.c_str(), mqttPassword.c_str());
            } else {
                connected = mqttClient->connect(clientId.c_str());
            }
            
            if (connected) {
                Serial.println("[OTA] MQTT connected, subscribing to: " + updateTopic);
                mqttClient->subscribe(updateTopic.c_str());
            } else {
                Serial.println("[OTA] MQTT connection failed, state: " + String(mqttClient->state()));
            }
        }
    } else {
        mqttClient->loop();
    }
    
    // Periodic update check
    if (millis() - lastCheck >= config.checkInterval) {
        lastCheck = millis();
        checkForUpdates();
    }
    
    // Handle pending download
    if (currentStatus == OtaStatus::DOWNLOADING && !pendingUrl.isEmpty()) {
        if (downloadFirmware(pendingUrl, pendingChecksum)) {
            updateStatus(OtaStatus::INSTALLING);
            if (installFirmware()) {
                updateStatus(OtaStatus::SUCCESS);
                config.currentVersion = pendingVersion;
            } else {
                updateStatus(OtaStatus::ERROR);
                if (config.enableRollback) {
                    performRollback();
                }
            }
        } else {
            retryCount++;
            if (retryCount >= config.maxRetries) {
                updateStatus(OtaStatus::ERROR);
                retryCount = 0;
            }
        }
        
        // Clear pending data
        pendingUrl = "";
        pendingChecksum = "";
        pendingVersion = "";
    }
}

// Check for updates (called periodically)
void ESP32OtaMqtt::checkForUpdates() {
    if (currentStatus != OtaStatus::IDLE) return;
    
    updateStatus(OtaStatus::CHECKING);
    // The actual check happens via MQTT callback
    // This just updates the status
    updateStatus(OtaStatus::IDLE);
}

