maxabba/Ota-mqtt-http/src/ESP32OtaMqtt.cpp
// Force a specific update
void ESP32OtaMqtt::forceUpdate(const String& version, const String& url, const String& checksum) {
    if (currentStatus != OtaStatus::IDLE) {
        reportError("Update already in progress");
        return;
    }
    
    pendingVersion = version;
    pendingUrl = url;
    pendingChecksum = checksum;
    retryCount = 0;
    
    updateStatus(OtaStatus::DOWNLOADING);
}

// Download firmware with progress tracking
bool ESP32OtaMqtt::downloadFirmware(const String& url, const String& expectedChecksum) {
    Serial.println("[OTA] Starting download from: " + url);
    
    // Prepare for OTA
    if (!Update.begin(UPDATE_SIZE_UNKNOWN)) {
        reportError("Cannot begin update", Update.getError());
        return false;
    }
    
    // Initialize SHA256 context for checksum calculation
    mbedtls_sha256_context sha256_ctx;
    mbedtls_sha256_init(&sha256_ctx);
    mbedtls_sha256_starts(&sha256_ctx, 0); // 0 = SHA256 (not SHA224)
    
    // Check if URL is HTTP or HTTPS
    bool isHTTPS = url.startsWith("https://");
    bool isHTTP = url.startsWith("http://");
    
    if (!isHTTP && !isHTTPS) {
        reportError("Invalid URL protocol. Must be HTTP or HTTPS");
        mbedtls_sha256_free(&sha256_ctx);
        Update.abort();
        return false;
    }
    
    // Parse URL and extract host, path, and port
    String host = "";
    String path = "";
    int port = isHTTPS ? 443 : 80;
    
    // Parse URL (simple parser for http(s)://host:port/path)
    int protocolEnd = url.indexOf("://");
    if (protocolEnd != -1) {
        int hostStart = protocolEnd + 3;
        int portStart = url.indexOf(':', hostStart);
        int pathStart = url.indexOf('/', hostStart);
        
        if (portStart != -1 && (pathStart == -1 || portStart < pathStart)) {
            // Port specified
            host = url.substring(hostStart, portStart);
            if (pathStart != -1) {
                port = url.substring(portStart + 1, pathStart).toInt();
                path = url.substring(pathStart);
            } else {
                port = url.substring(portStart + 1).toInt();
                path = "/";
            }
        } else if (pathStart != -1) {
            // No port, but path exists
            host = url.substring(hostStart, pathStart);
            path = url.substring(pathStart);
        } else {
            // No port, no path
            host = url.substring(hostStart);
            path = "/";
        }
    }
    
    Serial.println("[OTA] Protocol: " + String(isHTTPS ? "HTTPS" : "HTTP"));
    Serial.println("[OTA] Host: " + host);
    Serial.println("[OTA] Port: " + String(port));
    Serial.println("[OTA] Path: " + path);
    
    size_t written = 0;
    
    // For HTTP, we need to use a regular WiFiClient
    if (isHTTP) {
        Serial.println("[OTA] Using plain HTTP connection");
        WiFiClient httpClient;
        
        if (!httpClient.connect(host.c_str(), port)) {
            reportError("Connection to HTTP server failed");
            mbedtls_sha256_free(&sha256_ctx);
            Update.abort();
            return false;
        }
        
        // Send HTTP request
        httpClient.println("GET " + path + " HTTP/1.1");
        httpClient.println("Host: " + host);
        httpClient.println("Connection: close");
        httpClient.println();
        
        // Read response headers
        unsigned long timeout = millis() + config.downloadTimeout;
        int contentLength = 0;
        bool isChunked = false;
        
        while (httpClient.connected() && millis() < timeout) {
            String line = httpClient.readStringUntil('\n');
            line.trim();
            
            // Check for Content-Length header
            if (line.startsWith("Content-Length:")) {
                contentLength = line.substring(15).toInt();
                Serial.println("[OTA] Content-Length: " + String(contentLength));
            }
            // Check for chunked encoding
            else if (line.indexOf("Transfer-Encoding: chunked") >= 0) {
                isChunked = true;
                Serial.println("[OTA] Transfer-Encoding: chunked");
            }
            // End of headers
            else if (line.length() == 0) {
                break;
            }
        }
        
        // Download and write firmware
        unsigned long lastProgress = 0;
        uint8_t buffer[1024];
        
        while (httpClient.connected() && millis() < timeout) {
            size_t available = httpClient.available();
            if (available) {
                size_t bytesToRead = (available > sizeof(buffer)) ? sizeof(buffer) : available;
                size_t bytesRead = httpClient.readBytes(buffer, bytesToRead);
                
                if (bytesRead > 0) {
                    // Update SHA256 hash with downloaded data
                    mbedtls_sha256_update(&sha256_ctx, buffer, bytesRead);
                    
                    if (Update.write(buffer, bytesRead) != bytesRead) {
                        reportError("Write failed", Update.getError());
                        Update.abort();
                        httpClient.stop();
                        mbedtls_sha256_free(&sha256_ctx);
                        return false;
                    }
                    
                    written += bytesRead;
                    
                    // Update progress
                    if (contentLength > 0) {
                        int progress = (written * 100) / contentLength;
                        if (progress != lastProgress) {
                            updateStatus(OtaStatus::DOWNLOADING, progress);
                            lastProgress = progress;
                        }
                    } else if (written - lastProgress >= 10240) {
                        // Update every 10KB when content length unknown
                        Serial.print(".");
                        lastProgress = written;
                    }
                }
            }
            
