maxabba/Ota-mqtt-http/src/ESP32OtaMqtt.cpp
            // Check if download is complete
            if (contentLength > 0 && written >= contentLength) {
                break;
            }
            
            yield(); // Keep watchdog happy
        }
        
        httpClient.stop();
        Serial.println();
        Serial.println("[OTA] Downloaded " + String(written) + " bytes via HTTP");
        
        // Handle case where download failed but we need to cleanup
        if (written == 0) {
            mbedtls_sha256_free(&sha256_ctx);
            Update.abort();
        }
        
    } else {
        // HTTPS with dedicated WiFiClientSecure for download
        Serial.println("[OTA] Using HTTPS connection");
        
        // Create dedicated client for firmware download to avoid conflicts with MQTT client
        WiFiClientSecure downloadClient;
        downloadClient.setInsecure();
        Serial.println("[OTA] Using dedicated insecure HTTPS client for firmware download");
        
        if (!downloadClient.connect(host.c_str(), port)) {
            reportError("Connection to HTTPS server failed");
            mbedtls_sha256_free(&sha256_ctx);
            Update.abort();
            return false;
        }
        
        // Send HTTP request
        downloadClient.println("GET " + path + " HTTP/1.1");
        downloadClient.println("Host: " + host);
        downloadClient.println("Connection: close");
        downloadClient.println();
    
        // Read response headers
        unsigned long timeout = millis() + config.downloadTimeout;
        int contentLength = 0;
        
        while (downloadClient.connected() && millis() < timeout) {
            String line = downloadClient.readStringUntil('\n');
            line.trim();
            
            // Check for Content-Length header
            if (line.startsWith("Content-Length:")) {
                contentLength = line.substring(15).toInt();
                Serial.println("[OTA] Content-Length: " + String(contentLength));
            }
            // End of headers
            else if (line.length() == 0) {
                break;
            }
        }
        
        // Download and write firmware
        unsigned long lastProgress = 0;
        uint8_t buffer[1024];
        
        while (downloadClient.connected() && millis() < timeout) {
            size_t available = downloadClient.available();
            if (available) {
                size_t bytesToRead = (available > sizeof(buffer)) ? sizeof(buffer) : available;
                size_t bytesRead = downloadClient.readBytes(buffer, bytesToRead);
                
                if (bytesRead > 0) {
                    // Update SHA256 hash with downloaded data
                    mbedtls_sha256_update(&sha256_ctx, buffer, bytesRead);
                    
                    if (Update.write(buffer, bytesRead) != bytesRead) {
                        reportError("Write failed", Update.getError());
                        Update.abort();
                        downloadClient.stop();
                        mbedtls_sha256_free(&sha256_ctx);
                        return false;
                    }
                    
                    written += bytesRead;
                    
                    // Update progress
                    if (contentLength > 0) {
                        int progress = (written * 100) / contentLength;
                        if (progress != lastProgress) {
                            updateStatus(OtaStatus::DOWNLOADING, progress);
                            lastProgress = progress;
                        }
                    } else if (written - lastProgress >= 10240) {
                        // Update every 10KB when content length unknown
                        Serial.print(".");
                        lastProgress = written;
                    }
                }
            }
            
            // Check if download is complete
            if (contentLength > 0 && written >= contentLength) {
                break;
            }
            
            yield(); // Keep watchdog happy
        }
        
        downloadClient.stop();
        Serial.println();
        Serial.println("[OTA] Downloaded " + String(written) + " bytes via HTTPS");
        
        // Handle case where download failed but we need to cleanup
        if (written == 0) {
            mbedtls_sha256_free(&sha256_ctx);
            Update.abort();
        }
    }
    
    // Finalize SHA256 calculation
    unsigned char hash[32];
    mbedtls_sha256_finish(&sha256_ctx, hash);
    mbedtls_sha256_free(&sha256_ctx);
    
    // Convert hash to hex string
    calculatedChecksum = "";
    for (int i = 0; i < 32; i++) {
        char hex[3];
        sprintf(hex, "%02x", hash[i]);
        calculatedChecksum += hex;
    }
    
    // Finalize the update
    if (written == 0) {
        reportError("No data received from server");
        Update.abort();
        return false;
    }
    
    if (!Update.end(true)) {
        reportError("Update end failed", Update.getError());
        return false;
    }
    
    // Verify checksum if enabled
    if (config.verifyChecksum && !verifyChecksum(expectedChecksum)) {
        reportError("Checksum verification failed");
        Update.abort();  // Critical: abort the corrupted firmware
        return false;
    }
    
    Serial.println("[OTA] Firmware update ready to install");
    return true;
}

// Install firmware
bool ESP32OtaMqtt::installFirmware() {
    Serial.println("[OTA] Installing firmware...");
    
    // The firmware is already written by Update.write() in downloadFirmware()
    // Update.end() should have completed the installation
    
    if (Update.hasError()) {
        reportError("Installation failed", Update.getError());
        return false;
    }
    
    Serial.println("[OTA] Installation completed successfully");
    return true;
}

// Verify SHA256 checksum
bool ESP32OtaMqtt::verifyChecksum(const String& expectedChecksum) {
    Serial.println("[OTA] Expected checksum: " + expectedChecksum);
    Serial.println("[OTA] Calculated checksum: " + calculatedChecksum);
    
    // Convert both checksums to lowercase for comparison
    String expectedLower = expectedChecksum;
    String calculatedLower = calculatedChecksum;
    expectedLower.toLowerCase();
    calculatedLower.toLowerCase();
    
    bool isValid = (expectedLower == calculatedLower);
    
    if (isValid) {
        Serial.println("[OTA] Checksum verification: PASSED");
    } else {
        Serial.println("[OTA] Checksum verification: FAILED");
    }
    
