maxabba/Ota-mqtt-http/src/ESP32OtaMqtt.cpp
    return isValid;
}

// Perform rollback to previous firmware
void ESP32OtaMqtt::performRollback() {
    Serial.println("[OTA] Rollback requested...");
    updateStatus(OtaStatus::ROLLBACK);
    
    // Simple rollback strategy - just restart and hope for the best
    // In a production implementation, you would use ESP32 partition management
    reportError("Manual rollback required - restart device to previous firmware");
    Serial.println("[OTA] Restarting device...");
    delay(2000);
    ESP.restart();
}

// Update status and notify callback
void ESP32OtaMqtt::updateStatus(OtaStatus status, int progress) {
    currentStatus = status;
    
    if (statusCallback) {
        statusCallback(getStatusString(), progress);
    }
    
    Serial.println("[OTA] Status: " + getStatusString() + " (" + String(progress) + "%)");
}

// Report error and notify callback
void ESP32OtaMqtt::reportError(const String& error, int errorCode) {
    Serial.println("[OTA] Error: " + error + " (Code: " + String(errorCode) + ")");
    
    if (errorCallback) {
        errorCallback(error, errorCode);
    }
    
    currentStatus = OtaStatus::ERROR;
}

// Status methods
OtaStatus ESP32OtaMqtt::getStatus() const {
    return currentStatus;
}

String ESP32OtaMqtt::getStatusString() const {
    switch (currentStatus) {
        case OtaStatus::IDLE: return "IDLE";
        case OtaStatus::CHECKING: return "CHECKING";
        case OtaStatus::DOWNLOADING: return "DOWNLOADING";
        case OtaStatus::INSTALLING: return "INSTALLING";
        case OtaStatus::SUCCESS: return "SUCCESS";
        case OtaStatus::ERROR: return "ERROR";
        case OtaStatus::ROLLBACK: return "ROLLBACK";
        default: return "UNKNOWN";
    }
}

String ESP32OtaMqtt::getCurrentVersion() const {
    return config.currentVersion;
}

String ESP32OtaMqtt::getPendingVersion() const {
    return pendingVersion;
}

unsigned long ESP32OtaMqtt::getLastCheck() const {
    return lastCheck;
}

// Reset the updater
void ESP32OtaMqtt::reset() {
    currentStatus = OtaStatus::IDLE;
    pendingVersion = "";
    pendingUrl = "";
    pendingChecksum = "";
    retryCount = 0;
}

// Check if update is in progress
bool ESP32OtaMqtt::isUpdateInProgress() const {
    return currentStatus == OtaStatus::DOWNLOADING || 
           currentStatus == OtaStatus::INSTALLING ||
           currentStatus == OtaStatus::ROLLBACK;
}